<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Mitt Studium</title>
</head>
<body>

	<h1 style="text-align: center;">Hei!</h1>

	<h3>F&oslash;lgende funksjonalitet funker:</h3>

	<ul>
		<li>Navigering mellom sidene. (Stort sett realisert igjennom javascript/jQuery.) finnes i &quot;headeren&quot;</li>
		<li>Aktiv tilkobling til en database (mySQL, forel&oslash;pig kun lesing fra, men etter hvert skal man kunne skrive til den.)</li>
		<li>Navigering av en h&aring;ndful forskjellige fag inne p&aring; &quot;Finn din undervisningsplass&quot;.</li>
		<li>En &quot;footer&quot; med min epost adresse.</li>
		<li>Klikk p&aring; Logoen for &aring; komme tilbake til denne referanse siden, ellers kan man navigere ved &aring; klikke
			p&aring; &quot;knappene&quot; rett under logoen.</li>
	</ul>

	<hr />
	<h3>F&oslash;lgende funksjonalitet er p&aring; vei:</h3>

	<ul>
		<li>Muligheten til &aring; legge inn nye studiesteder (For enkelhetens skyld tror jeg dette kommer til &aring; tilbys som en
			&quot;pakke&quot;, der du legger inn et studie sted, navn p&aring; studie, og en review; det er enklest slikt mtp databasens
			oppbygging akkurat n&aring; (dette kan selvf&oslash;lgelig endre seg).</li>
		<li>Muligheten for &aring; lage seg brukere</li>
		<li>Diverse for &aring; &oslash;ke screentime. Mini-twitter-feed, og/eller noe rss feeds kansje?</li>
		<li>S&Oslash;KING</li>
		<li>B&oslash;r det kansje v&aelig;re slik at hvert studie-retning f&aring;r sin egen html side? Det vil forenkle arbeidet med
			&aring; presentere meta-data til brukere.</li>
		<li>muligheten til &aring; vurdere n&aring;v&aelig;rende studier.</li>
	</ul>

	<hr />
	<h3>Sm&aring;tt:</h3>

	<ul>
		<li>Knappene i navigasjonsmenyen har for mye padding p&aring; top og bottom</li>
		<li>S&oslash;kefeltet b&oslash;r strekkes litt mer ut</li>
		<li>Jeg har en linje mellom &quot;headeren&quot; og content, men ingen linje mellom footer og content. Kansje noe &aring; se
			p&aring; for &aring; opprettholde konsistens.</li>
		<li>Logoen var opprinnelig en midlertidig placeholder, men tror vi kan si oss forn&oslash;yd med den inntil vidre (i hovedsak
			fordi jeg ikke er flink nok til &aring; lage en skikkelig en).</li>
		<li>Entonet bakgrunnsfarge kan kansje utbedres med en eller annen form for collage av bilder (som fors&aring;vidt skal
			v&aelig;re j&aelig;vli lav resolution, da ingen orker &aring; laste 500 megabytes med bilder kontinuerling).</li>
	</ul>

	<hr />
	<h3>TL;DR:</h3>

	<ul>
		<li>Ting kommer fortl&oslash;pende.</li>
		<li>Yay info100</li>
	</ul>

</body>
</html>